marcolo-30/Proyecto2_RTOS/board/pin_mux.c
    gpio_pin_config_t E6_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE6 (pin 7)  */
    GPIO_PinInit(BOARD_INITPINS_E6_GPIO, BOARD_INITPINS_E6_PIN, &E6_config);

    gpio_pin_config_t E5_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE16 (pin 14)  */
    GPIO_PinInit(BOARD_INITPINS_E5_GPIO, BOARD_INITPINS_E5_PIN, &E5_config);

    gpio_pin_config_t E4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE17 (pin 15)  */
    GPIO_PinInit(BOARD_INITPINS_E4_GPIO, BOARD_INITPINS_E4_PIN, &E4_config);

    gpio_pin_config_t E3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE18 (pin 16)  */
    GPIO_PinInit(BOARD_INITPINS_E3_GPIO, BOARD_INITPINS_E3_PIN, &E3_config);

    gpio_pin_config_t E2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE19 (pin 17)  */
    GPIO_PinInit(BOARD_INITPINS_E2_GPIO, BOARD_INITPINS_E2_PIN, &E2_config);

    gpio_pin_config_t D4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE21 (pin 19)  */
    GPIO_PinInit(BOARD_INITPINS_D4_GPIO, BOARD_INITPINS_D4_PIN, &D4_config);

    gpio_pin_config_t D5_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE23 (pin 21)  */
    GPIO_PinInit(BOARD_INITPINS_D5_GPIO, BOARD_INITPINS_D5_PIN, &D5_config);

    gpio_pin_config_t D7_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE30 (pin 27)  */
    GPIO_PinInit(BOARD_INITPINS_D7_GPIO, BOARD_INITPINS_D7_PIN, &D7_config);

    gpio_pin_config_t E1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE31 (pin 28)  */
    GPIO_PinInit(BOARD_INITPINS_E1_GPIO, BOARD_INITPINS_E1_PIN, &E1_config);

    /* PORTA1 (pin 35) is configured as PTA1 */
    PORT_SetPinMux(BOARD_INITPINS_row1_PORT, BOARD_INITPINS_row1_PIN, kPORT_MuxAsGpio);

    /* PORTA12 (pin 42) is configured as PTA12 */
    PORT_SetPinMux(BOARD_INITPINS_row4_PORT, BOARD_INITPINS_row4_PIN, kPORT_MuxAsGpio);

    /* PORTA14 (pin 44) is configured as PTA14 */
    PORT_SetPinMux(BOARD_INITPINS_RS_PORT, BOARD_INITPINS_RS_PIN, kPORT_MuxAsGpio);

    /* PORTA2 (pin 36) is configured as PTA2 */
    PORT_SetPinMux(BOARD_INITPINS_row2_PORT, BOARD_INITPINS_row2_PIN, kPORT_MuxAsGpio);

    /* PORTA4 (pin 38) is configured as PTA4 */
    PORT_SetPinMux(BOARD_INITPINS_column1_PORT, BOARD_INITPINS_column1_PIN, kPORT_MuxAsGpio);

    PORTA->PCR[4] = ((PORTA->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullDown));

    /* PORTA5 (pin 39) is configured as PTA5 */
    PORT_SetPinMux(BOARD_INITPINS_column2_PORT, BOARD_INITPINS_column2_PIN, kPORT_MuxAsGpio);

    PORTA->PCR[5] = ((PORTA->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullDown));

    /* PORTA6 (pin 40) is configured as PTA6 */
    PORT_SetPinMux(BOARD_INITPINS_RW_PORT, BOARD_INITPINS_RW_PIN, kPORT_MuxAsGpio);

    /* PORTA7 (pin 41) is configured as PTA7 */
    PORT_SetPinMux(BOARD_INITPINS_E_PORT, BOARD_INITPINS_E_PIN, kPORT_MuxAsGpio);

    /* PORTB20 (pin 66) is configured as PTB20 */
    PORT_SetPinMux(BOARD_INITPINS_D6_PORT, BOARD_INITPINS_D6_PIN, kPORT_MuxAsGpio);

    /* PORTC0 (pin 70) is configured as PTC0 */
    PORT_SetPinMux(BOARD_INITPINS_S8_PORT, BOARD_INITPINS_S8_PIN, kPORT_MuxAsGpio);

    /* PORTC10 (pin 86) is configured as PTC10 */
    PORT_SetPinMux(BOARD_INITPINS_S4_PORT, BOARD_INITPINS_S4_PIN, kPORT_MuxAsGpio);

    /* PORTC11 (pin 87) is configured as PTC11 */
    PORT_SetPinMux(BOARD_INITPINS_S3_PORT, BOARD_INITPINS_S3_PIN, kPORT_MuxAsGpio);

    /* PORTC13 (pin 89) is configured as PTC13 */
    PORT_SetPinMux(BOARD_INITPINS_S2_PORT, BOARD_INITPINS_S2_PIN, kPORT_MuxAsGpio);

    /* PORTC16 (pin 90) is configured as PTC16 */
    PORT_SetPinMux(BOARD_INITPINS_S1_PORT, BOARD_INITPINS_S1_PIN, kPORT_MuxAsGpio);

    /* PORTC4 (pin 80) is configured as PTC4 */
    PORT_SetPinMux(BOARD_INITPINS_S7_PORT, BOARD_INITPINS_S7_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[4] = ((PORTC->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                     /* Slew Rate Enable: Slow slew rate is configured on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_SRE(kPORT_SlowSlewRate));

    /* PORTC6 (pin 82) is configured as PTC6 */
    PORT_SetPinMux(BOARD_INITPINS_S6_PORT, BOARD_INITPINS_S6_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[6] = ((PORTC->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                     /* Slew Rate Enable: Slow slew rate is configured on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_SRE(kPORT_SlowSlewRate));

