marcolo-30/Proyecto2_RTOS/board/pin_mux.c
    /* PORTC7 (pin 83) is configured as PTC7 */
    PORT_SetPinMux(BOARD_INITPINS_S5_PORT, BOARD_INITPINS_S5_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[7] = ((PORTC->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                     /* Slew Rate Enable: Slow slew rate is configured on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_SRE(kPORT_SlowSlewRate));

    /* PORTC8 (pin 84) is configured as PTC8 */
    PORT_SetPinMux(BOARD_INITPINS_column3_PORT, BOARD_INITPINS_column3_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[8] = ((PORTC->PCR[8] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullDown));

    /* PORTC9 (pin 85) is configured as PTC9 */
    PORT_SetPinMux(BOARD_INITPINS_column4_PORT, BOARD_INITPINS_column4_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[9] = ((PORTC->PCR[9] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullDown));

    /* PORTD3 (pin 96) is configured as PTD3 */
    PORT_SetPinMux(BOARD_INITPINS_row3_PORT, BOARD_INITPINS_row3_PIN, kPORT_MuxAsGpio);

    /* PORTE0 (pin 1) is configured as UART1_TX */
    PORT_SetPinMux(BOARD_INITPINS_TX_PORT, BOARD_INITPINS_TX_PIN, kPORT_MuxAlt3);

    /* PORTE1 (pin 2) is configured as UART1_RX */
    PORT_SetPinMux(BOARD_INITPINS_RX_PORT, BOARD_INITPINS_RX_PIN, kPORT_MuxAlt3);

    /* PORTE16 (pin 14) is configured as PTE16 */
    PORT_SetPinMux(BOARD_INITPINS_E5_PORT, BOARD_INITPINS_E5_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[16] = ((PORTE->PCR[16] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                      /* Slew Rate Enable: Slow slew rate is configured on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_SRE(kPORT_SlowSlewRate));

    /* PORTE17 (pin 15) is configured as PTE17 */
    PORT_SetPinMux(BOARD_INITPINS_E4_PORT, BOARD_INITPINS_E4_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[17] = ((PORTE->PCR[17] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                      /* Slew Rate Enable: Slow slew rate is configured on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_SRE(kPORT_SlowSlewRate));

    /* PORTE18 (pin 16) is configured as PTE18 */
    PORT_SetPinMux(BOARD_INITPINS_E3_PORT, BOARD_INITPINS_E3_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[18] = ((PORTE->PCR[18] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                      /* Slew Rate Enable: Slow slew rate is configured on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_SRE(kPORT_SlowSlewRate));

    /* PORTE19 (pin 17) is configured as PTE19 */
    PORT_SetPinMux(BOARD_INITPINS_E2_PORT, BOARD_INITPINS_E2_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[19] = ((PORTE->PCR[19] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                      /* Slew Rate Enable: Slow slew rate is configured on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_SRE(kPORT_SlowSlewRate));

    /* PORTE2 (pin 3) is configured as PTE2 */
    PORT_SetPinMux(BOARD_INITPINS_E8_PORT, BOARD_INITPINS_E8_PIN, kPORT_MuxAsGpio);

    /* PORTE21 (pin 19) is configured as PTE21 */
    PORT_SetPinMux(BOARD_INITPINS_D4_PORT, BOARD_INITPINS_D4_PIN, kPORT_MuxAsGpio);

    /* PORTE23 (pin 21) is configured as PTE23 */
    PORT_SetPinMux(BOARD_INITPINS_D5_PORT, BOARD_INITPINS_D5_PIN, kPORT_MuxAsGpio);

    /* PORTE3 (pin 4) is configured as PTE3 */
    PORT_SetPinMux(BOARD_INITPINS_E7_PORT, BOARD_INITPINS_E7_PIN, kPORT_MuxAsGpio);

    /* PORTE30 (pin 27) is configured as PTE30 */
    PORT_SetPinMux(BOARD_INITPINS_D7_PORT, BOARD_INITPINS_D7_PIN, kPORT_MuxAsGpio);

    /* PORTE31 (pin 28) is configured as PTE31 */
    PORT_SetPinMux(BOARD_INITPINS_E1_PORT, BOARD_INITPINS_E1_PIN, kPORT_MuxAsGpio);

    /* PORTE6 (pin 7) is configured as PTE6 */
    PORT_SetPinMux(BOARD_INITPINS_E6_PORT, BOARD_INITPINS_E6_PIN, kPORT_MuxAsGpio);

    SIM->SOPT5 = ((SIM->SOPT5 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT5_UART1TXSRC_MASK | SIM_SOPT5_UART1RXSRC_MASK)))

                  /* UART1 Transmit Data Source Select: UART1_TX pin. */
                  | SIM_SOPT5_UART1TXSRC(SOPT5_UART1TXSRC_UART_TX)

                  /* UART1 Receive Data Source Select: UART1_RX pin. */
                  | SIM_SOPT5_UART1RXSRC(SOPT5_UART1RXSRC_UART_RX));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
